Revit 2027 API
ParameterTypeId.GutterProfileParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GutterProfileParam { get; }
Public Shared ReadOnly Property GutterProfileParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GutterProfileParam {
	ForgeTypeId^ get ();
}
static member GutterProfileParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace